nxp-mcuxpresso/mcux-soc-svd/MCXN547/MCXN547_cm33_core0.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>EMVSIM0</name>
      <description>EMVSIM</description>
      <groupName>EMVSIM</groupName>
      <headerStructName>EMVSIM</headerStructName>
      <baseAddress>0x40103000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EMVSIM0</name>
        <value>103</value>
      </interrupt>
      <registers>
        <register>
          <name>VER_ID</name>
          <description>Version ID</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VER</name>
              <description>Version ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameters</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_FIFO_DEPTH</name>
              <description>Receive FIFO Depth</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_FIFO_DEPTH</name>
              <description>Transmit FIFO Depth</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKCFG</name>
          <description>Clock Configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_PRSC</name>
              <description>Clock Prescaler Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPCNT1_CLK_SEL</name>
              <description>General Purpose Counter 1 Clock Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable/reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cardclk</name>
                  <description>Card clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rxclk</name>
                  <description>Receive clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>txclk</name>
                  <description>ETU clock (transmit clock)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPCNT0_CLK_SEL</name>
              <description>General Purpose Counter 0 Clock Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Disable/reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cardclk</name>
                  <description>Card clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rxclk</name>
                  <description>Receive clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>txclk</name>
                  <description>ETU clock (transmit clock)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVISOR</name>
          <description>Baud Rate Divisor</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x174</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVISOR_VALUE</name>
              <description>Divisor (F/D) Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>invalid_0</name>
                  <description>Invalid. As per ISO 7816 specification, the minimum value of F/D is 5.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>invalid_1</name>
                  <description>Invalid. As per ISO 7816 specification, the minimum value of F/D is 5.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>invalid_2</name>
                  <description>Invalid. As per ISO 7816 specification, the minimum value of F/D is 5.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>invalid_3</name>
                  <description>Invalid. As per ISO 7816 specification, the minimum value of F/D is 5.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>invalid_4</name>
                  <description>Invalid. As per ISO 7816 specification, the minimum value of F/D is 5.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_5</name>
                  <description>Divisor value F/D</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_6</name>
                  <description>Divisor value F/D</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_7</name>
                  <description>Divisor value F/D</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_8</name>
                  <description>Divisor value F/D</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_9</name>
                  <description>Divisor value F/D</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_10</name>
                  <description>Divisor value F/D</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_11</name>
                  <description>Divisor value F/D</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_12</name>
                  <description>Divisor value F/D</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_13</name>
                  <description>Divisor value F/D</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_14</name>
                  <description>Divisor value F/D</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_250</name>
                  <description>Divisor value F/D</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_251</name>
                  <description>Divisor value F/D</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_252</name>
                  <description>Divisor value F/D</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_253</name>
                  <description>Divisor value F/D</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_254</name>
                  <description>Divisor value F/D</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>valid_255</name>
                  <description>Divisor value F/D</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
